app/controllers/items_controller.rb

SELECT "items".* FROM "items" LIMIT ?  [["LIMIT", 20]]
---
    def index
        if(params['page'].nil?)
            @items = Item.all.limit(20);

SELECT "items".* FROM "items" WHERE "items"."category_id" = ?  [["category_id", nil]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def cat
        @items = Item.where(category:params[:category])
        @category = Category.find(params[:category])