app/controllers/users_controller.rb

    def index
        if(session[:user_id].nil?)
            redirect_to('/login')
            return;
        end
        @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def create
        @user = User.create(user_params)
---
INSERT INTO "users" ("full_name", "phone_number", "email", "verified", "address", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

    def authenticate
        usr = User.where(email:params[:email]).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "admin@example.com"], ["LIMIT", 1]]